Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
            <register>
               <name>RLP_CFG</name>
               <description>Rounding, Limiting and Packing Configuration Register</description>
               <addressOffset>0x3D0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Rounding, Limiting and Packing Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>DAT8</name>
                           <description>8-bit data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAT9</name>
                           <description>9-bit data</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAT10</name>
                           <description>10-bit data</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAT11</name>
                           <description>11-bit data</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAT12</name>
                           <description>12-bit data</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATY8</name>
                           <description>8-bit luminance only</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATY10</name>
                           <description>10-bit luminance only</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARGB444</name>
                           <description>12-bit RGB+4-bit Alpha (MSB)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARGB555</name>
                           <description>15-bit RGB+1-bit Alpha (MSB)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RGB565</name>
                           <description>16-bit RGB</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARGB32</name>
                           <description>24-bits RGB mode+8-bit Alpha</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YYCC</name>
                           <description>YCbCr mode (full range, [0-255])</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YYCC_LIMITED</name>
                           <description>YCbCr mode (limited range)</description>
                           <value>0xC</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALPHA</name>
                     <description>Alpha Value for Alpha-enabled RGB Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HIS_CTRL</name>
               <description>Histogram Control Register</description>
               <addressOffset>0x3D4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Histogram Sub Module Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HIS_CFG</name>
               <description>Histogram Configuration Register</description>
               <addressOffset>0x3D8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Histogram Operating Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>Gr</name>
                           <description>Gr sampling</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R</name>
                           <description>R sampling</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Gb</name>
                           <description>Gb sampling</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B</name>
                           <description>B sampling</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Y</name>
                           <description>Luminance-only mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAW</name>
                           <description>Raw sampling</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YCCIR656</name>
                           <description>Luminance only with CCIR656 10-bit or 8-bit mode</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BAYSEL</name>
                     <description>Bayer Color Component Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BAYSELSelect</name>
                        <enumeratedValue>
                           <name>GRGR</name>
                           <description>Starting row configuration is G R G R (red row)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RGRG</name>
                           <description>Starting row configuration is R G R G (red row)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GBGB</name>
                           <description>Starting row configuration is G B G B (blue row</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BGBG</name>
                           <description>Starting row configuration is B G B G (blue row)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RAR</name>
                     <description>Histogram Reset After Read</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCFG</name>
               <description>DMA Configuration Register</description>
               <addressOffset>0x3E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IMODE</name>
                     <description>DMA Input Mode Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>IMODESelect</name>
                        <enumeratedValue>
                           <name>PACKED8</name>
                           <description>8 bits, single channel packed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PACKED16</name>
                           <description>16 bits, single channel packed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PACKED32</name>
                           <description>32 bits, single channel packed</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YC422SP</name>
                           <description>32 bits, dual channel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YC422P</name>
                           <description>32 bits, triple channel</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YC420SP</name>
                           <description>32 bits, dual channel</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YC420P</name>
                           <description>32 bits, triple channel</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>YMBSIZE</name>
                     <description>DMA Memory Burst Size Y channel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>YMBSIZESelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>DMA single access</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS4</name>
                           <description>4-beat burst access</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS8</name>
                           <description>8-beat burst access</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS16</name>
                           <description>16-beat burst access</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMBSIZE</name>
                     <description>DMA Memory Burst Size C channel</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMBSIZESelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>DMA single access</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS4</name>
                           <description>4-beat burst access</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS8</name>
                           <description>8-beat burst access</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEATS16</name>
                           <description>16-beat burst access</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCTRL</name>
               <description>DMA Control Register</description>
               <addressOffset>0x3E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DE</name>
                     <description>Descriptor Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DVIEW</name>
                     <description>Descriptor View</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DVIEWSelect</name>
                        <enumeratedValue>
                           <name>PACKED</name>
                           <description>Address {0} Stride {0} are updated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEMIPLANAR</name>
                           <description>Address {0,1} Stride {0,1} are updated</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLANAR</name>
                           <description>Address {0,1,2} Stride {0,1,2} are updated</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WB</name>
                     <description>Write Back Operation Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIELD</name>
                     <description>Value of Captured Frame Field Signal(1)(2)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>Descriptor Processing Status(2)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DNDA</name>
               <description>DMA Descriptor Address Register</description>
               <addressOffset>0x3E8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NDA</name>
                     <description>Next Descriptor Address Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>3</dim>
               <dimIncrement>8</dimIncrement>
               <name>ISC_SUB0[%s]</name>
               <description/>
               <addressOffset>0x3EC</addressOffset>
               <register>
                  <name>DAD</name>
                  <description>DMA Address 0 Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>AD0</name>
                        <description>Channel 0 Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DST</name>
                  <description>DMA Stride 0 Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>ST0</name>
                        <description>Channel 0 Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>512</dim>
               <dimIncrement>4</dimIncrement>
               <name>HIS_ENTRY[%s]</name>
               <description>Histogram Entry</description>
               <addressOffset>0x410</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Entry Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
