Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
            <register>
               <name>MINFO4_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 4 Register</description>
               <alternateRegister>MINFO4_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P4_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO5_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 5 Register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT5_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO5_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 5 Register</description>
               <alternateRegister>MINFO5_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P5_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO5_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 5 Register</description>
               <alternateRegister>MINFO5_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P5_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO6_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 6 Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT6_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO6_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 6 Register</description>
               <alternateRegister>MINFO6_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P6_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO6_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 6 Register</description>
               <alternateRegister>MINFO6_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P6_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO7_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 7 Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT7_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO7_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 7 Register</description>
               <alternateRegister>MINFO7_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P7_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO7_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 7 Register</description>
               <alternateRegister>MINFO7_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P7_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x444452</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
