Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
            <register>
               <name>FSMR</name>
               <description>Fast Startup Mode Register</description>
               <addressOffset>0x0070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSTT0</name>
                     <description>Fast Startup from WKUP Pin Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT1</name>
                     <description>Fast Startup from Security Module Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT2</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT3</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT4</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT5</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT6</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT7</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT8</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT9</name>
                     <description>Fast Startup from PIOBU0-7 Input Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT10</name>
                     <description>Fast Start-up from GMAC Wake-up On LAN Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAL</name>
                     <description>Fast Startup from RTC Alarm Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBAL</name>
                     <description>Fast Startup from USB Resume Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC_CD</name>
                     <description>Fast Startup from SDMMC Card Detect Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM</name>
                     <description>Low-power Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLP_MCE</name>
                     <description>Fast Startup from Backup UART Receive Match Condition Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACC_CE</name>
                     <description>Fast Startup from Analog Comparator Controller Comparison Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSPR</name>
               <description>Fast Startup Polarity Register</description>
               <addressOffset>0x0074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSTP0</name>
                     <description>WKUP Pin Polarity for Fast Startup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP1</name>
                     <description>Security Module Polarity for Fast Startup</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP2</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP3</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP4</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP5</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP6</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP7</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP8</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP9</name>
                     <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP10</name>
                     <description>GMAC Wake-up On LAN Polarity for Fast Start-up</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOCR</name>
               <description>Fault Output Clear Register</description>
               <addressOffset>0x0078</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FOCLR</name>
                     <description>Fault Output Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLICPR</name>
               <description>PLL Charge Pump Current Register</description>
               <addressOffset>0x0080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ICP_PLLA</name>
                     <description>Charge Pump Current</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICP_PLLU</name>
                     <description>Charge Pump Current PLL UTMI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IVCO_PLLU</name>
                     <description>Voltage Control Output Current PLL UTMI</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write ProtectIon Mode Register</description>
               <addressOffset>0x00E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x504D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCER1</name>
               <description>Peripheral Clock Enable Register 1</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Peripheral Clock 32 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Peripheral Clock 33 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID34</name>
                     <description>Peripheral Clock 34 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID35</name>
                     <description>Peripheral Clock 35 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID36</name>
                     <description>Peripheral Clock 36 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID37</name>
                     <description>Peripheral Clock 37 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID38</name>
                     <description>Peripheral Clock 38 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID39</name>
                     <description>Peripheral Clock 39 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID40</name>
                     <description>Peripheral Clock 40 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID41</name>
                     <description>Peripheral Clock 41 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID42</name>
                     <description>Peripheral Clock 42 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID43</name>
                     <description>Peripheral Clock 43 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Peripheral Clock 44 Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Peripheral Clock 45 Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID46</name>
                     <description>Peripheral Clock 46 Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID47</name>
                     <description>Peripheral Clock 47 Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID48</name>
                     <description>Peripheral Clock 48 Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID49</name>
                     <description>Peripheral Clock 49 Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Peripheral Clock 50 Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID51</name>
                     <description>Peripheral Clock 51 Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID52</name>
                     <description>Peripheral Clock 52 Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Peripheral Clock 53 Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID54</name>
                     <description>Peripheral Clock 54 Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID55</name>
                     <description>Peripheral Clock 55 Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID56</name>
                     <description>Peripheral Clock 56 Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID57</name>
                     <description>Peripheral Clock 57 Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID58</name>
                     <description>Peripheral Clock 58 Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Peripheral Clock 59 Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID60</name>
                     <description>Peripheral Clock 60 Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID61</name>
                     <description>Peripheral Clock 61 Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID62</name>
                     <description>Peripheral Clock 62 Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID63</name>
                     <description>Peripheral Clock 63 Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
