Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SDMMC0">
         <name>SDMMC1</name>
         <baseAddress>0xB0000000</baseAddress>
         <interrupt>
            <name>SDMMC1</name>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>SDMMC1_TIMER</name>
            <value>72</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SECUMOD</name>
         <version>44107B</version>
         <description>Security Module</description>
         <groupName>SECUMOD</groupName>
         <prependToName>SECUMOD_</prependToName>
         <baseAddress>0xFC040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x94</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SECUMOD</name>
            <value>16</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NORMAL</name>
                     <description>Normal Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWPROT</name>
                     <description>Software Protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCRAMB</name>
                     <description>Memory Scrambling Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSR</name>
               <description>System Status Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ERASE_DONE</name>
                     <description>Erasable Memories State (RW)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERASE_ON</name>
                     <description>Erase Process Ongoing (RO)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Mode (RO)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWKUP</name>
                     <description>SWKUP State (RO)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTOBKP</name>
                     <description>Automatic Backup Mode Enabled (RO)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCRAMB</name>
                     <description>Scrambling Enabled (RO)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <description>Status Clear Register</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RAMRDY</name>
               <description>RAM Access Ready Register</description>
               <addressOffset>0x0014</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>Ready for system access flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>PIOBU[%s]</name>
               <description>PIO Backup Register</description>
               <addressOffset>0x0018</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PIOBU_AFV</name>
                     <description>PIOBU Alarm Filter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PIOBU_RFV</name>
                     <description>PIOBUx Reset Filter Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OUTPUT</name>
                     <description>Configure I/O Line in Input/Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIO_SOD</name>
                     <description>Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIO_PDS</name>
                     <description>Level on the Pin in Input Mode (OUTPUT = 0) (Read-only)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PULLUP</name>
                     <description>Programmable Pull-up State</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCHEDULE</name>
                     <description>Pull-up/Down Scheduled</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWITCH</name>
                     <description>Switch State for Intrusion Detection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAGCR</name>
               <description>JTAG Protection Control Register</description>
               <addressOffset>0x0068</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FNTRST</name>
                     <description>Force NTRST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CA5_DEBUG_MODE</name>
                     <description>Cortex-A5 Invasive/Non-Invasive Secure/Non-Secure Debug Permissions</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>WZO</name>
                     <description>Write ZERO</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRKEY</name>
               <description>Scrambling Key Register</description>
               <addressOffset>0x0070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SCRKEY</name>
                     <description>Scrambling Key Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RAMACC</name>
               <description>RAM Access Rights Register</description>
               <addressOffset>0x0074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RW0</name>
                     <description>Access right for RAM region [0; 1 Kbyte]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW1</name>
                     <description>Access right for RAM region [1 Kbyte; 2 Kbytes]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW2</name>
                     <description>Access right for RAM region [2 Kbytes; 3 Kbytes]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW3</name>
                     <description>Access right for RAM region [3 Kbytes; 4 Kbytes]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW4</name>
                     <description>Access right for RAM region [4 Kbytes; 5 Kbytes]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW5</name>
                     <description>Access right for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RAMACCSR</name>
               <description>RAM Access Rights Status Register</description>
               <addressOffset>0x0078</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RW0</name>
                     <description>Access right status for RAM region [0; 1 Kbyte]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW1</name>
                     <description>Access right status for RAM region [1 Kbytes; 2 Kbytes]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW2</name>
                     <description>Access right status for RAM region [2 Kbytes; 3 Kbytes]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW3</name>
                     <description>Access right status for RAM region [3 Kbytes; 4 Kbytes]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW4</name>
                     <description>Access right status for RAM region [4 Kbytes; 5 Kbytes]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RW5</name>
                     <description>Access right status for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMPR</name>
               <description>Backup Mode Protection Register</description>
               <addressOffset>0x007C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMPR</name>
               <description>Normal Mode Protection Register</description>
               <addressOffset>0x0080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
