Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
            <register>
               <name>HSMC_SIGMA21</name>
               <description>PMECC Error Location SIGMA 21 Register</description>
               <addressOffset>0x57C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA21</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA22</name>
               <description>PMECC Error Location SIGMA 22 Register</description>
               <addressOffset>0x580</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA22</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA23</name>
               <description>PMECC Error Location SIGMA 23 Register</description>
               <addressOffset>0x584</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA23</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA24</name>
               <description>PMECC Error Location SIGMA 24 Register</description>
               <addressOffset>0x588</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA24</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA25</name>
               <description>PMECC Error Location SIGMA 25 Register</description>
               <addressOffset>0x58C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA25</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA26</name>
               <description>PMECC Error Location SIGMA 26 Register</description>
               <addressOffset>0x590</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA26</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA27</name>
               <description>PMECC Error Location SIGMA 27 Register</description>
               <addressOffset>0x594</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA27</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA28</name>
               <description>PMECC Error Location SIGMA 28 Register</description>
               <addressOffset>0x598</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA28</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA29</name>
               <description>PMECC Error Location SIGMA 29 Register</description>
               <addressOffset>0x59C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA29</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA30</name>
               <description>PMECC Error Location SIGMA 30 Register</description>
               <addressOffset>0x5A0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA30</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA31</name>
               <description>PMECC Error Location SIGMA 31 Register</description>
               <addressOffset>0x5A4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA31</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA32</name>
               <description>PMECC Error Location SIGMA 32 Register</description>
               <addressOffset>0x5A8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA32</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSMC_ERRLOC[%s]</name>
               <description>PMECC Error Location 0 Register</description>
               <addressOffset>0x5AC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRLOCN</name>
                     <description>Error Position within the Set {sector area, spare area}</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>20</dimIncrement>
               <name>SMC_CS_NUMBER[%s]</name>
               <description/>
               <addressOffset>0x700</addressOffset>
               <register>
                  <name>HSMC_SETUP</name>
                  <description>Setup Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_SETUP</name>
                        <description>NWE Setup Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_SETUP</name>
                        <description>NCS Setup Length in Write Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NRD_SETUP</name>
                        <description>NRD Setup Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_SETUP</name>
                        <description>NCS Setup Length in Read Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_PULSE</name>
                  <description>Pulse Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_PULSE</name>
                        <description>NWE Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_PULSE</name>
                        <description>NCS Pulse Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NRD_PULSE</name>
                        <description>NRD Pulse Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_PULSE</name>
                        <description>NCS Pulse Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_CYCLE</name>
                  <description>Cycle Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_CYCLE</name>
                        <description>Total Write Cycle Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>NRD_CYCLE</name>
                        <description>Total Read Cycle Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_TIMINGS</name>
                  <description>Timings Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>TCLR</name>
                        <description>CLE to REN Low Delay</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TADL</name>
                        <description>ALE to Data Start</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TAR</name>
                        <description>ALE to REN Low Delay</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>OCMS</name>
                        <description>Off Chip Memory Scrambling Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRR</name>
                        <description>Ready to REN Low Delay</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TWB</name>
                        <description>WEN High to REN to Busy</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>NFSEL</name>
                        <description>NAND Flash Selection</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_MODE</name>
                  <description>Mode Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>READ_MODE</name>
                        <description>Selection of the Control Signal for Read Operation</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>READ_MODESelect</name>
                           <enumeratedValue>
                              <name>NCS_CTRL</name>
                              <description>The Read operation is controlled by the NCS signal.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NRD_CTRL</name>
                              <description>The Read operation is controlled by the NRD signal.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WRITE_MODE</name>
                        <description>Selection of the Control Signal for Write Operation</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>WRITE_MODESelect</name>
                           <enumeratedValue>
                              <name>NCS_CTRL</name>
                              <description>The Write operation is controller by the NCS signal.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NWE_CTRL</name>
                              <description>The Write operation is controlled by the NWE signal</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EXNW_MODE</name>
                        <description>NWAIT Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EXNW_MODESelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Disabled-The NWAIT input signal is ignored on the corresponding Chip Select.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READY</name>
                              <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAT</name>
                        <description>Byte Access Type</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>BATSelect</name>
                           <enumeratedValue>
                              <name>BYTE_SELECT</name>
                              <description>Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTE_WRITE</name>
                              <description>Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DBW</name>
                        <description>Data Bus Width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DBWSelect</name>
                           <enumeratedValue>
                              <name>BIT_8</name>
                              <description>8-bit bus</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT_16</name>
                              <description>16-bit bus</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TDF_CYCLES</name>
                        <description>Data Float Time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TDF_MODE</name>
                        <description>TDF Optimization</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>HSMC_OCMS</name>
               <description>Off Chip Memory Scrambling Register</description>
               <addressOffset>0x7A0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMSE</name>
                     <description>Static Memory Controller Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRSE</name>
                     <description>NFC Internal SRAM Scrambling Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_KEY1</name>
               <description>Off Chip Memory Scrambling KEY1 Register</description>
               <addressOffset>0x7A4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off Chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_KEY2</name>
               <description>Off Chip Memory Scrambling KEY2 Register</description>
               <addressOffset>0x7A8</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off Chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x7E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
