Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CD1G.svd
            <register>
               <name>CLRINT</name>
               <description>UDPHS Clear Interrupt Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DET_SUSPD</name>
                     <description>Suspend Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MICRO_SOF</name>
                     <description>Micro Start Of Frame Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_SOF</name>
                     <description>Start Of Frame Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRESET</name>
                     <description>End Of Reset Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE_UP</name>
                     <description>Wake Up CPU Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDOFRSM</name>
                     <description>End Of Resume Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPSTR_RES</name>
                     <description>Upstream Resume Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EPTRST</name>
               <description>UDPHS Endpoints Reset Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>EPT_0</name>
                     <description>Endpoint 0 Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_1</name>
                     <description>Endpoint 1 Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_2</name>
                     <description>Endpoint 2 Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_3</name>
                     <description>Endpoint 3 Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_4</name>
                     <description>Endpoint 4 Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_5</name>
                     <description>Endpoint 5 Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_6</name>
                     <description>Endpoint 6 Reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_7</name>
                     <description>Endpoint 7 Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_8</name>
                     <description>Endpoint 8 Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_9</name>
                     <description>Endpoint 9 Reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_10</name>
                     <description>Endpoint 10 Reset</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_11</name>
                     <description>Endpoint 11 Reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_12</name>
                     <description>Endpoint 12 Reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_13</name>
                     <description>Endpoint 13 Reset</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_14</name>
                     <description>Endpoint 14 Reset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_15</name>
                     <description>Endpoint 15 Reset</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TST</name>
               <description>UDPHS Test Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SPEED_CFG</name>
                     <description>Speed Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SPEED_CFGSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_SPEED</name>
                           <description>Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_SPEED</name>
                           <description>Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TST_J</name>
                     <description>Test J Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TST_K</name>
                     <description>Test K Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TST_PKT</name>
                     <description>Test Packet Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPMODE2</name>
                     <description>OpMode2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDRSIZE</name>
               <description>UDPHS IP Address Size Register</description>
               <addressOffset>0xEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDRSIZE</name>
                     <description>Peripheral Bus Address Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IPNAME[%s]</name>
               <description>UDPHS IP Name1 Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IPNAME</name>
                     <description>IP Name in ASCII Format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEATURES</name>
               <description>UDPHS Features Register</description>
               <addressOffset>0xF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <cluster>
               <dim>16</dim>
               <dimIncrement>32</dimIncrement>
               <name>UDPHS_EPT[%s]</name>
               <description/>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>EPTCFG</name>
                  <description>UDPHS Endpoint Configuration Register (endpoint = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>EPT_SIZE</name>
                        <description>Endpoint Size (cleared upon USB reset)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EPT_SIZESelect</name>
                           <enumeratedValue>
                              <name>_8</name>
                              <description>8 bytes</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16</name>
                              <description>16 bytes</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_32</name>
                              <description>32 bytes</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_64</name>
                              <description>64 bytes</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_128</name>
                              <description>128 bytes</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_256</name>
                              <description>256 bytes</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_512</name>
                              <description>512 bytes</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_1024</name>
                              <description>1024 bytes</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EPT_DIR</name>
                        <description>Endpoint Direction (cleared upon USB reset)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPT_TYPE</name>
                        <description>Endpoint Type (cleared upon USB reset)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EPT_TYPESelect</name>
                           <enumeratedValue>
                              <name>CTRL8</name>
                              <description>Control endpoint</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ISO</name>
                              <description>Isochronous endpoint</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BULK</name>
                              <description>Bulk endpoint</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INT</name>
                              <description>Interrupt endpoint</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BK_NUMBER</name>
                        <description>Number of Banks (cleared upon USB reset)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BK_NUMBERSelect</name>
                           <enumeratedValue>
                              <name>_0</name>
                              <description>Zero bank, the endpoint is not mapped in memory</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_1</name>
                              <description>One bank (bank 0)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_2</name>
                              <description>Double bank (Ping-Pong: bank0/bank1)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_3</name>
                              <description>Triple bank (bank0/bank1/bank2)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NB_TRANS</name>
                        <description>Number Of Transaction per Microframe (cleared upon USB reset)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>EPT_MAPD</name>
                        <description>Endpoint Mapped (cleared upon USB reset)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCTLENB</name>
                  <description>UDPHS Endpoint Control Enable Register (endpoint = 0)</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>EPT_ENABL</name>
                        <description>Endpoint Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupts Disable DMA</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NYET_DIS</name>
                        <description>NYET Disable (Only for High Speed Bulk OUT endpoints)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY</name>
                        <description>TX Packet Ready Interrupt Enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RX_SETUP</name>
                        <description>Received SETUP</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STALL_SNT</name>
                        <description>Stall Sent Interrupt Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_IN</name>
                        <description>NAKIN Interrupt Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_OUT</name>
                        <description>NAKOUT Interrupt Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Send/Short Packet Interrupt Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
